ir_version: 6
producer_name: "pytorch"
producer_version: "1.9"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "892"
    output: "87"
    name: "ConstantOfShape_0"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "893"
    input: "87"
    output: "88"
    name: "Concat_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "89"
    name: "Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "88"
    input: "89"
    output: "90"
    name: "Reshape_3"
    op_type: "Reshape"
  }
  node {
    output: "91"
    name: "Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "92"
    name: "Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "93"
    name: "Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "94"
    name: "Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "90"
    input: "92"
    input: "93"
    input: "91"
    input: "94"
    output: "95"
    name: "Slice_8"
    op_type: "Slice"
  }
  node {
    input: "95"
    output: "96"
    name: "Transpose_9"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "97"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "96"
    input: "97"
    output: "98"
    name: "Reshape_11"
    op_type: "Reshape"
  }
  node {
    input: "98"
    output: "99"
    name: "Cast_12"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "input_image"
    input: "99"
    output: "100"
    name: "Pad_13"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "100"
    input: "block_a.0.1.weight"
    output: "101"
    name: "Conv_14"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "102"
    name: "Constant_15"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "101"
    input: "102"
    output: "103"
    name: "Reshape_16"
    op_type: "Reshape"
  }
  node {
    output: "104"
    name: "Constant_17"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "105"
    name: "Constant_18"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "103"
    input: "104"
    input: "105"
    output: "106"
    name: "InstanceNormalization_19"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "101"
    output: "107"
    name: "Shape_20"
    op_type: "Shape"
  }
  node {
    input: "106"
    input: "107"
    output: "108"
    name: "Reshape_21"
    op_type: "Reshape"
  }
  node {
    input: "108"
    input: "894"
    output: "110"
    name: "Mul_22"
    op_type: "Mul"
  }
  node {
    input: "110"
    input: "895"
    output: "112"
    name: "Add_23"
    op_type: "Add"
  }
  node {
    input: "112"
    output: "113"
    name: "LeakyRelu_24"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "899"
    output: "123"
    name: "ConstantOfShape_25"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "900"
    input: "123"
    output: "124"
    name: "Concat_26"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "125"
    name: "Constant_27"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "124"
    input: "125"
    output: "126"
    name: "Reshape_28"
    op_type: "Reshape"
  }
  node {
    output: "127"
    name: "Constant_29"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "128"
    name: "Constant_30"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "129"
    name: "Constant_31"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "130"
    name: "Constant_32"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "126"
    input: "128"
    input: "129"
    input: "127"
    input: "130"
    output: "131"
    name: "Slice_33"
    op_type: "Slice"
  }
  node {
    input: "131"
    output: "132"
    name: "Transpose_34"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "133"
    name: "Constant_35"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "132"
    input: "133"
    output: "134"
    name: "Reshape_36"
    op_type: "Reshape"
  }
  node {
    input: "134"
    output: "135"
    name: "Cast_37"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "113"
    input: "135"
    output: "136"
    name: "Pad_38"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "136"
    input: "block_a.1.1.weight"
    output: "137"
    name: "Conv_39"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "138"
    name: "Constant_40"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "137"
    input: "138"
    output: "139"
    name: "Reshape_41"
    op_type: "Reshape"
  }
  node {
    output: "140"
    name: "Constant_42"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "141"
    name: "Constant_43"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "139"
    input: "140"
    input: "141"
    output: "142"
    name: "InstanceNormalization_44"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "137"
    output: "143"
    name: "Shape_45"
    op_type: "Shape"
  }
  node {
    input: "142"
    input: "143"
    output: "144"
    name: "Reshape_46"
    op_type: "Reshape"
  }
  node {
    input: "144"
    input: "901"
    output: "146"
    name: "Mul_47"
    op_type: "Mul"
  }
  node {
    input: "146"
    input: "902"
    output: "148"
    name: "Add_48"
    op_type: "Add"
  }
  node {
    input: "148"
    output: "149"
    name: "LeakyRelu_49"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "906"
    output: "159"
    name: "ConstantOfShape_50"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "907"
    input: "159"
    output: "160"
    name: "Concat_51"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "161"
    name: "Constant_52"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "160"
    input: "161"
    output: "162"
    name: "Reshape_53"
    op_type: "Reshape"
  }
  node {
    output: "163"
    name: "Constant_54"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "164"
    name: "Constant_55"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "165"
    name: "Constant_56"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "166"
    name: "Constant_57"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "162"
    input: "164"
    input: "165"
    input: "163"
    input: "166"
    output: "167"
    name: "Slice_58"
    op_type: "Slice"
  }
  node {
    input: "167"
    output: "168"
    name: "Transpose_59"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "169"
    name: "Constant_60"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "168"
    input: "169"
    output: "170"
    name: "Reshape_61"
    op_type: "Reshape"
  }
  node {
    input: "170"
    output: "171"
    name: "Cast_62"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "149"
    input: "171"
    output: "172"
    name: "Pad_63"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "172"
    input: "block_a.2.1.weight"
    output: "173"
    name: "Conv_64"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "174"
    name: "Constant_65"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "173"
    input: "174"
    output: "175"
    name: "Reshape_66"
    op_type: "Reshape"
  }
  node {
    output: "176"
    name: "Constant_67"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "177"
    name: "Constant_68"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "175"
    input: "176"
    input: "177"
    output: "178"
    name: "InstanceNormalization_69"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "173"
    output: "179"
    name: "Shape_70"
    op_type: "Shape"
  }
  node {
    input: "178"
    input: "179"
    output: "180"
    name: "Reshape_71"
    op_type: "Reshape"
  }
  node {
    input: "180"
    input: "908"
    output: "182"
    name: "Mul_72"
    op_type: "Mul"
  }
  node {
    input: "182"
    input: "909"
    output: "184"
    name: "Add_73"
    op_type: "Add"
  }
  node {
    input: "184"
    output: "185"
    name: "LeakyRelu_74"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "185"
    output: "186"
    name: "Shape_75"
    op_type: "Shape"
  }
  node {
    output: "187"
    name: "Constant_76"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "186"
    input: "187"
    output: "188"
    name: "Gather_77"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "185"
    output: "189"
    name: "Shape_78"
    op_type: "Shape"
  }
  node {
    output: "190"
    name: "Constant_79"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "189"
    input: "190"
    output: "191"
    name: "Gather_80"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "913"
    output: "201"
    name: "ConstantOfShape_81"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "914"
    input: "201"
    output: "202"
    name: "Concat_82"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "203"
    name: "Constant_83"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "202"
    input: "203"
    output: "204"
    name: "Reshape_84"
    op_type: "Reshape"
  }
  node {
    output: "205"
    name: "Constant_85"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "206"
    name: "Constant_86"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "207"
    name: "Constant_87"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "208"
    name: "Constant_88"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "204"
    input: "206"
    input: "207"
    input: "205"
    input: "208"
    output: "209"
    name: "Slice_89"
    op_type: "Slice"
  }
  node {
    input: "209"
    output: "210"
    name: "Transpose_90"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "211"
    name: "Constant_91"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "210"
    input: "211"
    output: "212"
    name: "Reshape_92"
    op_type: "Reshape"
  }
  node {
    input: "212"
    output: "213"
    name: "Cast_93"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "185"
    input: "213"
    output: "214"
    name: "Pad_94"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "214"
    input: "block_b.0.1.weight"
    output: "215"
    name: "Conv_95"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    output: "216"
    name: "Constant_96"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "215"
    input: "216"
    output: "217"
    name: "Reshape_97"
    op_type: "Reshape"
  }
  node {
    output: "218"
    name: "Constant_98"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "219"
    name: "Constant_99"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "217"
    input: "218"
    input: "219"
    output: "220"
    name: "InstanceNormalization_100"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "215"
    output: "221"
    name: "Shape_101"
    op_type: "Shape"
  }
  node {
    input: "220"
    input: "221"
    output: "222"
    name: "Reshape_102"
    op_type: "Reshape"
  }
  node {
    input: "222"
    input: "915"
    output: "224"
    name: "Mul_103"
    op_type: "Mul"
  }
  node {
    input: "224"
    input: "916"
    output: "226"
    name: "Add_104"
    op_type: "Add"
  }
  node {
    input: "226"
    output: "227"
    name: "LeakyRelu_105"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "920"
    output: "237"
    name: "ConstantOfShape_106"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "921"
    input: "237"
    output: "238"
    name: "Concat_107"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "239"
    name: "Constant_108"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "238"
    input: "239"
    output: "240"
    name: "Reshape_109"
    op_type: "Reshape"
  }
  node {
    output: "241"
    name: "Constant_110"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "242"
    name: "Constant_111"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "243"
    name: "Constant_112"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "244"
    name: "Constant_113"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "240"
    input: "242"
    input: "243"
    input: "241"
    input: "244"
    output: "245"
    name: "Slice_114"
    op_type: "Slice"
  }
  node {
    input: "245"
    output: "246"
    name: "Transpose_115"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "247"
    name: "Constant_116"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "246"
    input: "247"
    output: "248"
    name: "Reshape_117"
    op_type: "Reshape"
  }
  node {
    input: "248"
    output: "249"
    name: "Cast_118"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "227"
    input: "249"
    output: "250"
    name: "Pad_119"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "250"
    input: "block_b.1.1.weight"
    output: "251"
    name: "Conv_120"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "252"
    name: "Constant_121"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "251"
    input: "252"
    output: "253"
    name: "Reshape_122"
    op_type: "Reshape"
  }
  node {
    output: "254"
    name: "Constant_123"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "255"
    name: "Constant_124"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "253"
    input: "254"
    input: "255"
    output: "256"
    name: "InstanceNormalization_125"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "251"
    output: "257"
    name: "Shape_126"
    op_type: "Shape"
  }
  node {
    input: "256"
    input: "257"
    output: "258"
    name: "Reshape_127"
    op_type: "Reshape"
  }
  node {
    input: "258"
    input: "922"
    output: "260"
    name: "Mul_128"
    op_type: "Mul"
  }
  node {
    input: "260"
    input: "923"
    output: "262"
    name: "Add_129"
    op_type: "Add"
  }
  node {
    input: "262"
    output: "263"
    name: "LeakyRelu_130"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "927"
    output: "273"
    name: "ConstantOfShape_131"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "928"
    input: "273"
    output: "274"
    name: "Concat_132"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "275"
    name: "Constant_133"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "274"
    input: "275"
    output: "276"
    name: "Reshape_134"
    op_type: "Reshape"
  }
  node {
    output: "277"
    name: "Constant_135"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "278"
    name: "Constant_136"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "279"
    name: "Constant_137"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "280"
    name: "Constant_138"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "276"
    input: "278"
    input: "279"
    input: "277"
    input: "280"
    output: "281"
    name: "Slice_139"
    op_type: "Slice"
  }
  node {
    input: "281"
    output: "282"
    name: "Transpose_140"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "283"
    name: "Constant_141"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "282"
    input: "283"
    output: "284"
    name: "Reshape_142"
    op_type: "Reshape"
  }
  node {
    input: "284"
    output: "285"
    name: "Cast_143"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "263"
    input: "285"
    output: "286"
    name: "Pad_144"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "286"
    input: "block_c.0.1.weight"
    output: "287"
    name: "Conv_145"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "288"
    name: "Constant_146"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "287"
    input: "288"
    output: "289"
    name: "Reshape_147"
    op_type: "Reshape"
  }
  node {
    output: "290"
    name: "Constant_148"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "291"
    name: "Constant_149"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "289"
    input: "290"
    input: "291"
    output: "292"
    name: "InstanceNormalization_150"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "287"
    output: "293"
    name: "Shape_151"
    op_type: "Shape"
  }
  node {
    input: "292"
    input: "293"
    output: "294"
    name: "Reshape_152"
    op_type: "Reshape"
  }
  node {
    input: "294"
    input: "929"
    output: "296"
    name: "Mul_153"
    op_type: "Mul"
  }
  node {
    input: "296"
    input: "930"
    output: "298"
    name: "Add_154"
    op_type: "Add"
  }
  node {
    input: "298"
    output: "299"
    name: "LeakyRelu_155"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "934"
    output: "309"
    name: "ConstantOfShape_156"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "935"
    input: "309"
    output: "310"
    name: "Concat_157"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "311"
    name: "Constant_158"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "310"
    input: "311"
    output: "312"
    name: "Reshape_159"
    op_type: "Reshape"
  }
  node {
    output: "313"
    name: "Constant_160"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "314"
    name: "Constant_161"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "315"
    name: "Constant_162"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "316"
    name: "Constant_163"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "312"
    input: "314"
    input: "315"
    input: "313"
    input: "316"
    output: "317"
    name: "Slice_164"
    op_type: "Slice"
  }
  node {
    input: "317"
    output: "318"
    name: "Transpose_165"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "319"
    name: "Constant_166"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "318"
    input: "319"
    output: "320"
    name: "Reshape_167"
    op_type: "Reshape"
  }
  node {
    input: "320"
    output: "321"
    name: "Cast_168"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "299"
    input: "321"
    output: "322"
    name: "Pad_169"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "322"
    input: "block_c.1.layers.0.1.weight"
    output: "323"
    name: "Conv_170"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "324"
    name: "Constant_171"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "323"
    input: "324"
    output: "325"
    name: "Reshape_172"
    op_type: "Reshape"
  }
  node {
    output: "326"
    name: "Constant_173"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "327"
    name: "Constant_174"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "325"
    input: "326"
    input: "327"
    output: "328"
    name: "InstanceNormalization_175"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "323"
    output: "329"
    name: "Shape_176"
    op_type: "Shape"
  }
  node {
    input: "328"
    input: "329"
    output: "330"
    name: "Reshape_177"
    op_type: "Reshape"
  }
  node {
    input: "330"
    input: "936"
    output: "332"
    name: "Mul_178"
    op_type: "Mul"
  }
  node {
    input: "332"
    input: "937"
    output: "334"
    name: "Add_179"
    op_type: "Add"
  }
  node {
    input: "334"
    output: "335"
    name: "LeakyRelu_180"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "941"
    output: "345"
    name: "ConstantOfShape_181"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "942"
    input: "345"
    output: "346"
    name: "Concat_182"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "347"
    name: "Constant_183"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "346"
    input: "347"
    output: "348"
    name: "Reshape_184"
    op_type: "Reshape"
  }
  node {
    output: "349"
    name: "Constant_185"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "350"
    name: "Constant_186"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "351"
    name: "Constant_187"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "352"
    name: "Constant_188"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "348"
    input: "350"
    input: "351"
    input: "349"
    input: "352"
    output: "353"
    name: "Slice_189"
    op_type: "Slice"
  }
  node {
    input: "353"
    output: "354"
    name: "Transpose_190"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "355"
    name: "Constant_191"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "354"
    input: "355"
    output: "356"
    name: "Reshape_192"
    op_type: "Reshape"
  }
  node {
    input: "356"
    output: "357"
    name: "Cast_193"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "335"
    input: "357"
    output: "358"
    name: "Pad_194"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "358"
    input: "block_c.1.layers.1.1.weight"
    input: "block_c.1.layers.1.1.bias"
    output: "359"
    name: "Conv_195"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "360"
    name: "Constant_196"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "359"
    input: "360"
    output: "361"
    name: "Reshape_197"
    op_type: "Reshape"
  }
  node {
    output: "362"
    name: "Constant_198"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "363"
    name: "Constant_199"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "361"
    input: "362"
    input: "363"
    output: "364"
    name: "InstanceNormalization_200"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "359"
    output: "365"
    name: "Shape_201"
    op_type: "Shape"
  }
  node {
    input: "364"
    input: "365"
    output: "366"
    name: "Reshape_202"
    op_type: "Reshape"
  }
  node {
    input: "366"
    input: "943"
    output: "368"
    name: "Mul_203"
    op_type: "Mul"
  }
  node {
    input: "368"
    input: "944"
    output: "370"
    name: "Add_204"
    op_type: "Add"
  }
  node {
    input: "370"
    output: "371"
    name: "LeakyRelu_205"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "371"
    input: "block_c.1.layers.2.weight"
    output: "372"
    name: "Conv_206"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "373"
    name: "Constant_207"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "372"
    input: "373"
    output: "374"
    name: "Reshape_208"
    op_type: "Reshape"
  }
  node {
    output: "375"
    name: "Constant_209"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "376"
    name: "Constant_210"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "374"
    input: "375"
    input: "376"
    output: "377"
    name: "InstanceNormalization_211"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "372"
    output: "378"
    name: "Shape_212"
    op_type: "Shape"
  }
  node {
    input: "377"
    input: "378"
    output: "379"
    name: "Reshape_213"
    op_type: "Reshape"
  }
  node {
    input: "379"
    input: "945"
    output: "381"
    name: "Mul_214"
    op_type: "Mul"
  }
  node {
    input: "381"
    input: "946"
    output: "383"
    name: "Add_215"
    op_type: "Add"
  }
  node {
    input: "950"
    output: "393"
    name: "ConstantOfShape_216"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "951"
    input: "393"
    output: "394"
    name: "Concat_217"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "395"
    name: "Constant_218"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "394"
    input: "395"
    output: "396"
    name: "Reshape_219"
    op_type: "Reshape"
  }
  node {
    output: "397"
    name: "Constant_220"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "398"
    name: "Constant_221"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "399"
    name: "Constant_222"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "400"
    name: "Constant_223"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "396"
    input: "398"
    input: "399"
    input: "397"
    input: "400"
    output: "401"
    name: "Slice_224"
    op_type: "Slice"
  }
  node {
    input: "401"
    output: "402"
    name: "Transpose_225"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "403"
    name: "Constant_226"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "402"
    input: "403"
    output: "404"
    name: "Reshape_227"
    op_type: "Reshape"
  }
  node {
    input: "404"
    output: "405"
    name: "Cast_228"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "383"
    input: "405"
    output: "406"
    name: "Pad_229"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "406"
    input: "block_c.2.layers.0.1.weight"
    output: "407"
    name: "Conv_230"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "408"
    name: "Constant_231"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "407"
    input: "408"
    output: "409"
    name: "Reshape_232"
    op_type: "Reshape"
  }
  node {
    output: "410"
    name: "Constant_233"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "411"
    name: "Constant_234"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "409"
    input: "410"
    input: "411"
    output: "412"
    name: "InstanceNormalization_235"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "407"
    output: "413"
    name: "Shape_236"
    op_type: "Shape"
  }
  node {
    input: "412"
    input: "413"
    output: "414"
    name: "Reshape_237"
    op_type: "Reshape"
  }
  node {
    input: "414"
    input: "952"
    output: "416"
    name: "Mul_238"
    op_type: "Mul"
  }
  node {
    input: "416"
    input: "953"
    output: "418"
    name: "Add_239"
    op_type: "Add"
  }
  node {
    input: "418"
    output: "419"
    name: "LeakyRelu_240"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "957"
    output: "429"
    name: "ConstantOfShape_241"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "958"
    input: "429"
    output: "430"
    name: "Concat_242"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "431"
    name: "Constant_243"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "430"
    input: "431"
    output: "432"
    name: "Reshape_244"
    op_type: "Reshape"
  }
  node {
    output: "433"
    name: "Constant_245"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "434"
    name: "Constant_246"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "435"
    name: "Constant_247"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "436"
    name: "Constant_248"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "432"
    input: "434"
    input: "435"
    input: "433"
    input: "436"
    output: "437"
    name: "Slice_249"
    op_type: "Slice"
  }
  node {
    input: "437"
    output: "438"
    name: "Transpose_250"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 1
      ints: 0
      type: INTS
    }
  }
  node {
    output: "439"
    name: "Constant_251"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "438"
    input: "439"
    output: "440"
    name: "Reshape_252"
    op_type: "Reshape"
  }
  node {
    input: "440"
    output: "441"
    name: "Cast_253"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 7
      type: INT
    }
  }
  node {
    input: "419"
    input: "441"
    output: "442"
    name: "Pad_254"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "reflect"
      type: STRING
    }
  }
  node {
    input: "442"
    input: "block_c.2.layers.1.1.weight"
    input: "block_c.2.layers.1.1.bias"
    output: "443"
    name: "Conv_255"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 512
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    output: "444"
    name: "Constant_256"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "443"
    input: "444"
    output: "445"
    name: "Reshape_257"
    op_type: "Reshape"
  }
  node {
    output: "446"
    name: "Constant_258"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "447"
    name: "Constant_259"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "445"
    input: "446"
    input: "447"
    output: "448"
    name: "InstanceNormalization_260"
    op_type: "InstanceNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
  }
  node {
    input: "443"
    output: "449"
    name: "Shape_261"
    op_type: "Shape"
  }
  node {
    input: "448"
    input: "449"
    output: "450"
    name: "Reshape_262"
    op_type: "Reshape"
  }
  node {
    input: "450"
    input: "959"
    output: "452"
    name: "Mul_263"
    op_type: "Mul"
  }
  node {
    input: "452"
    input: "960"
    output: "454"
    name: "Add_264"
    op_type: "Add"
  }
  node {
    input: "454"
    output: "455"
    name: "LeakyRelu_265"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "455"
    input: "block_c.2.layers.2.weight"
    output: "456"
    name: "Conv_266"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
